[
  {
    "id": 1,
    "tmdb_id": 329865,
    "title": "Arrival",
    "year": "2016",
    "poster_path": "/x2FJsf1ElAgr63Y3PNPtJrcmpoe.jpg",
    "overview": "Taking place after alien crafts land around the world, an expert linguist is recruited by the military to determine whether they come in peace or are a threat.",
    "watched": true,
    "rating": "3",
    "review": "s"
  },
  {
    "id": 2,
    "tmdb_id": 11,
    "title": "Star Wars",
    "year": "1977",
    "poster_path": "/6FfCtAuVAW8XJjZ7eWeLibRLWTw.jpg",
    "overview": "Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker and dashing captain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.",
    "watched": false,
    "rating": null,
    "review": ""
  },
  {
    "id": 3,
    "tmdb_id": 273248,
    "title": "The Hateful Eight",
    "year": "2015",
    "poster_path": "/jIywvdPjia2t3eKYbjVTcwBQlG8.jpg",
    "overview": "Bounty hunters seek shelter from a raging blizzard and get caught up in a plot of betrayal and deception.",
    "watched": false,
    "rating": null,
    "review": ""
  },
  {
    "id": 4,
    "tmdb_id": 120467,
    "title": "The Grand Budapest Hotel",
    "year": "2014",
    "poster_path": "/eWdyYQreja6JGCzqHWXpWHDrrPo.jpg",
    "overview": "The Grand Budapest Hotel tells of a legendary concierge at a famous European hotel between the wars and his friendship with a young employee who becomes his trusted protégé. The story involves the theft and recovery of a priceless Renaissance painting, the battle for an enormous family fortune and the slow and then sudden upheavals that transformed Europe during the first half of the 20th century.",
    "watched": false,
    "rating": null,
    "review": ""
  },
  {
    "id": 5,
    "tmdb_id": 1233413,
    "title": "Sinners",
    "year": "2025",
    "poster_path": "/fWPgbnt2LSqkQ6cdQc0SZN9CpLm.jpg",
    "overview": "Trying to leave their troubled lives behind, twin brothers return to their hometown to start again, only to discover that an even greater evil is waiting to welcome them back.",
    "watched": false,
    "rating": null,
    "review": ""
  },
  {
    "id": 6,
    "tmdb_id": 16869,
    "title": "Inglourious Basterds",
    "year": "2009",
    "poster_path": "/7sfbEnaARXDDhKm0CZ7D7uc2sbo.jpg",
    "overview": "In Nazi-occupied France during World War II, a group of Jewish-American soldiers known as \"The Basterds\" are chosen specifically to spread fear throughout the Third Reich by scalping and brutally killing Nazis. The Basterds, lead by Lt. Aldo Raine soon cross paths with a French-Jewish teenage girl who runs a movie theater in Paris which is targeted by the soldiers.",
    "watched": false,
    "rating": null,
    "review": ""
  },
  {
    "id": 7,
    "tmdb_id": 211672,
    "title": "Minions",
    "year": "2015",
    "poster_path": "/dr02BdCNAUPVU07aOodwPYv6HCf.jpg",
    "overview": "Minions Stuart, Kevin and Bob are recruited by Scarlet Overkill, a super-villain who, alongside her inventor husband Herb, hatches a plot to take over the world.",
    "watched": false,
    "rating": null,
    "review": ""
  }
]